Revit 2024 API
BaseExportOptions.GetExportPatternTable Method
 Gets a copy of the pattern table.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public ExportPatternTable GetExportPatternTable()
Visual Basic
Public Function GetExportPatternTable As ExportPatternTable
Visual C++
public:
ExportPatternTable^ GetExportPatternTable()
Return Value
 The pattern table.
See Also
BaseExportOptions Class
Autodesk.Revit.DB Namespace